#Дано натуральні числа M і N.Визначити старшу цифру дробової частини і молодшу цифру цілої частини частки від ділення M на N.
M=int(input("Введіть число M:"))#введенння першого числа
N=int(input("Введіть число N:"))#введення другого числа
C=(M/N)%10#обчислення молодшої цифри
print("Молодша цифра=",int(C))#виведення молодшої цифри
D=((M*10)/N)%10#обчислення старшої цифри
print("Старша цифра=",int(D))#виведення старшої цифри