/*Дані натуральні числа M і N.Визначити старшу цифру дробової частини і молодшу цифру цілої частини частки від ділення M/N.*/
#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "UKR");
    int M;int N;//оголошення змінних M,N
    cout<<"число М:";cin >>M;
    cout<<"\nчисло N:";cin>>N;//введення чисел M,N
    int C;//оголошення змінної С
    C = (M / N) % 10;//обчислення молодшої цифри
    cout<<"\nМолодша цифра="<< C;//виведення молодшої цифри
    int D;//оголошення змінної D
    D = ((M * 10) / N) % 10;//обчислення старшої цифри
    cout << "\nСтарша цифра=" << D;//виведення старшої цифри
}
 